import { arrayToObject } from '../common'

describe('测试矩阵转换的方法', () => {
    it('给定制定矩阵，能转成符合需求的对象', () => {
        const data = [
            ['标题', '地址', '年龄', '部门'],
            ['张三', '重庆市', 20, '产品研发部'],
            ['李四', '北京市', 21, '智能作业部'],
        ]
        const result = [
            {
                '标题': '张三',
                '地址': '重庆市',
                '年龄': 20,
                '部门': '产品研发部'
            },
            {
                '标题': '李四',
                '地址': '北京市',
                '年龄': 21,
                '部门': '智能作业部'
            }
        ]
        expect(arrayToObject(data)).toEqual(result)
    })
})